{
  "hunting": [
    {
      "displayName": "TestHuntingRule1",
      "description": "test",
      "query": "SecurityEvent | where EventID == \"4687\" | where CommandLine contains \"-noni -ep bypass $\"",
      "tactics": [
        "Persistence",
        "LateralMovement",
        "Exfiltration"
      ]
    },
    {
      "displayName": "TestHuntingRule2",
      "description": "test",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "tactics": [
        "Persistence",
        "LateralMovement"
      ]
    }
  ]
}
